int/resources/objectRepo/xmlTemplates/htng/HTNG2008BExt/req_FetchProductItems.xml

<soapenv:Envelope xmlns:wsa="http://schemas.xmlsoap.org/ws/2004/08/addressing" xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd" xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd"  xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:typ="http://webservices.micros.com/htng/2008B/SingleGuestItinerary/Information/Types" xmlns:typ1="http://htng.org/PWS/2008B/SingleGuestItinerary/Common/Types">
   <soapenv:Header/>
   <soapenv:Body>
      <typ:FetchProductItemsRequest>
         <typ:TimeSpan>
            <typ1:Start/>
            <typ1:End/>
         </typ:TimeSpan>
         <typ:Language/>
         <typ:ResortId/>
      </typ:FetchProductItemsRequest>
   </soapenv:Body>
</soapenv:Envelope>